Revit 2027 API
MathComparisonUtils.IsGreaterThan Method
 Checks if value1 is strictly greater than value2, using the internal tolerance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsGreaterThan(
	double value1,
	double value2
)
Public Shared Function IsGreaterThan (
	value1 As Double,
	value2 As Double
) As Boolean
public:
static bool IsGreaterThan(
	double value1,
	double value2
)
static member IsGreaterThan :
        value1 : float *
        value2 : float -> bool
Parameters
value1 Double
 The first value.
value2 Double
 The second value.
Return Value
Boolean
 True if value1 is strictly greater than value2, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The given value for value1 is not finite -or- The given value for value2 is not finite
See Also
Reference
MathComparisonUtils Class
Autodesk.Revit.DB Namespace